In [1]:
import numpy as np
import pandas as pd

Lecture du fichier csv téléchargé

In [4]:
df = pd.read_csv("Data/donnees_financieres_300k_lignes.csv")
df

              Date Ticker        Prix
0       2000-01-03   AAPL    0.841048
1       2000-01-04   AAPL    0.770139
2       2000-01-05   AAPL    0.781409
3       2000-01-06   AAPL    0.713786
4       2000-01-07   AAPL    0.747598
...            ...    ...         ...
410130  2024-12-26   TMUS  222.115051
410131  2024-12-27   TMUS  221.459686
410132  2024-12-28   TMUS         NaN
410133  2024-12-29   TMUS         NaN
410134  2024-12-30   TMUS  219.116196

[410135 rows x 3 columns]

In [5]:
print(df.head(10))  # Affiche les 5 premières lignes

         Date Ticker      Prix
0  2000-01-03   AAPL  0.841048
1  2000-01-04   AAPL  0.770139
2  2000-01-05   AAPL  0.781409
3  2000-01-06   AAPL  0.713786
4  2000-01-07   AAPL  0.747598
5  2000-01-10   AAPL  0.734449
6  2000-01-11   AAPL  0.696881
7  2000-01-12   AAPL  0.655088
8  2000-01-13   AAPL  0.726935
9  2000-01-14   AAPL  0.754642

In [6]:
df.columns

Index(['Date', 'Ticker', 'Prix'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=410135, step=1)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 410135 entries, 0 to 410134
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Date    410135 non-null  object
 1   Ticker  410135 non-null  object
 2   Prix    309504 non-null  float64
dtypes: float64(1), object(2)
memory usage: 9.4+ MB

In [9]:
df['Date'] = pd.to_datetime(df['Date'])

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 410135 entries, 0 to 410134
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Date    410135 non-null  datetime64[ns]
 1   Ticker  410135 non-null  object
 2   Prix    309504 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 9.4+ MB

In [11]:
df['Ticker'] = df['Ticker'].astype('string')  # Conversion en string

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 410135 entries, 0 to 410134
Data columns (total 3 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Date    410135 non-null  datetime64[ns]
 1   Ticker  410135 non-null  string
 2   Prix    309504 non-null  float64
dtypes: datetime64[ns](1), float64(1), string(1)
memory usage: 9.4 MB

In [13]:
df.shape

(410135, 3)

In [ ]:
df.describe()  # Affiche les statistiques descriptives
#df.describe(include='all')  # Inclut les colonnes non numériques

                                Date           Prix
count                         410135  309504.000000
mean   2013-08-27 15:47:57.779267584     326.550231
min              2000-01-03 00:00:00       0.056319
25%              2007-06-05 00:00:00      19.721205
50%              2014-10-16 00:00:00      41.920311
75%              2019-11-23 00:00:00     100.769588
max              2024-12-30 00:00:00  106140.601562
std                              NaN    3242.860602